{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Cropping2D", "config": {"name": "cropping2d_7", "batch_input_shape": [null, 160, 320, 3], "trainable": true, "input_dtype": "float32", "cropping": [[60, 0], [0, 0]]}}, {"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u001f\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000|\u0001\u0000j\u0001\u0000j\u0002\u0000|\u0000\u0000d\u0004\u0000\u0083\u0002\u0000S)\u0005N\u00e9\u0000\u0000\u0000\u0000\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000)\u0002r\u0002\u0000\u0000\u0000r\u0003\u0000\u0000\u0000)\u0003\u00da\ntensorflow\u00da\u0005image\u00da\rresize_images)\u0002r\u0005\u0000\u0000\u0000\u00da\u0002tf\u00a9\u0000r\b\u0000\u0000\u0000\u00fa\u0015.\\model_original11.py\u00da\u0006resize\r\u0001\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\f\u0001", null, null], "trainable": true, "output_shape_type": "raw", "name": "lambda_13", "function_type": "lambda", "output_shape": null, "arguments": {}}}, {"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0005imager\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u0015.\\model_original11.py\u00da\u000fnormalize_image\t\u0001\u0000\u0000s\u0002\u0000\u0000\u0000\u0000\u0001", null, null], "trainable": true, "output_shape_type": "raw", "name": "lambda_14", "function_type": "lambda", "output_shape": null, "arguments": {}}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "nb_col": 5, "W_constraint": null, "trainable": true, "nb_filter": 24, "name": "convolution2d_31", "b_regularizer": null, "init": "he_normal", "dim_ordering": "tf", "nb_row": 5, "bias": true, "activation": "elu", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_33", "trainable": true, "p": 0.25}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "same", "pool_size": [2, 2], "name": "maxpooling2d_19", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "nb_col": 5, "W_constraint": null, "trainable": true, "nb_filter": 36, "name": "convolution2d_32", "b_regularizer": null, "init": "he_normal", "dim_ordering": "tf", "nb_row": 5, "bias": true, "activation": "elu", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_34", "trainable": true, "p": 0.25}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "same", "pool_size": [2, 2], "name": "maxpooling2d_20", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "nb_col": 5, "W_constraint": null, "trainable": true, "nb_filter": 48, "name": "convolution2d_33", "b_regularizer": null, "init": "he_normal", "dim_ordering": "tf", "nb_row": 5, "bias": true, "activation": "elu", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_35", "trainable": true, "p": 0.25}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "border_mode": "same", "pool_size": [2, 2], "name": "maxpooling2d_21", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "nb_col": 3, "W_constraint": null, "trainable": true, "nb_filter": 64, "name": "convolution2d_34", "b_regularizer": null, "init": "he_normal", "dim_ordering": "tf", "nb_row": 3, "bias": true, "activation": "elu", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_36", "trainable": true, "p": 0.25}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "nb_col": 3, "W_constraint": null, "trainable": true, "nb_filter": 64, "name": "convolution2d_35", "b_regularizer": null, "init": "he_normal", "dim_ordering": "tf", "nb_row": 3, "bias": true, "activation": "elu", "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_37", "trainable": true, "p": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_7", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "input_dim": 1152, "output_dim": 100, "W_constraint": null, "trainable": true, "b_regularizer": null, "init": "he_normal", "name": "dense_25", "bias": true, "activation": "elu"}}, {"class_name": "Dropout", "config": {"name": "dropout_38", "trainable": true, "p": 0.25}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "input_dim": 100, "output_dim": 50, "W_constraint": null, "trainable": true, "b_regularizer": null, "init": "he_normal", "name": "dense_26", "bias": true, "activation": "elu"}}, {"class_name": "Dropout", "config": {"name": "dropout_39", "trainable": true, "p": 0.25}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "input_dim": 50, "output_dim": 10, "W_constraint": null, "trainable": true, "b_regularizer": null, "init": "he_normal", "name": "dense_27", "bias": true, "activation": "elu"}}, {"class_name": "Dropout", "config": {"name": "dropout_40", "trainable": true, "p": 0.25}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "input_dim": 10, "output_dim": 1, "W_constraint": null, "trainable": true, "b_regularizer": null, "init": "he_normal", "name": "dense_28", "bias": true, "activation": "tanh"}}]}